Repository: eugeneai/paper-zont-2017
Catalog: omegat/omegat/project_save.tmx
Source language: ru
Languages: en_us

source: Рассматривается проблематика автоматизации создания текстовых документов при активном использовании декларативных средств и технологий открытых связных данных.
en_us: The problems of automating the creation of text documents with the active use of declarative tools and technologies of Linked Open Data is discussed.

source: Рассмотрено несколько примеров приложения разработанных программ.
en_us: Several examples of the application of the developed software are considered.

source: Рассмотрим схему представления размеченной рабочей программы в разработанной системе.
en_us: Consider the scheme of representation of a marked up work program in the proposed system.

source: Реализация этого сервиса достаточно проста, так как любой RDF-граф представим в формате JSON (JSON-LD).
en_us: The implementation of this service is simple enough because any RDF graph is representable as JSON (JSON-LD).

source: Реализованы функции копирования документа, загрузки данных одного документа в другой.
en_us: Copy functions and document data substitution from one document to another has been implemented.

source: Редактируемый документ очень просто может быть перемещен (скопирован) из одного solid-хранилища в другое.
en_us: The edited document be moved (copied) from one Solid-store to another one easily.

source: Редактируемый документ представляет собой аннотацию порождаемого документа, т.е. сначала он сам себя аннотирует, а после завершения подготовки окончательной версии документа – на его неизменяемую копию, например, на свой PDF.
en_us: The edited document is an annotation to the target document, i.e., at the beginning the documents annotates itself, and after the completion of the final version of the document, the annotation annotates the generated immutable copy, e.g., the PDF file of the document.

source: Редактор позволяет добавлять в текст новую RDFa-разметку, при этом эта интересующая нас функция реализована в самом общем виде.
en_us: The user is able to add a new RDFa markup with editor's tools, in this case, the function of our interest is implemented in the most general form.

source: Результатом распознавания таблицы является выгрузка данных в реляционную таблицу [7].
en_us: The recognition result of the tables is the data in a relational table [7].

source: Результаты получены при частичной поддержке следующих проектов:
en_us: The results obtained with the partial support of the following projects:

source: Результаты предполагается внедрить в задаче публикации данных результатов исследований в области высокопроизводительного секвенирования ДНК/РНК, провидимых в Лимнологическом институте СО РАН.
en_us: The results are expected to be applied for automation of data publication of research results in the field of high-throughput sequencing of DNA/RNA carried out at the Limnological Institute SB RAS.

source: Результирующий документ помещается в хранилище данных, распечатывается или загружается на рабочую станцию пользователя в виде HTML-файла.
en_us: The resulting document is placed in the data warehouse, printed or downloaded to the user workstation as an HTML file.

source: Ресурс oa (закладка) находится в двух основных отношениях с другими ресурсами: oa:hasTarget, oa:hasBody.
en_us: An oa resource (an bookmark) is in two major relations to other resources: oa:hasTarget, oa:hasBody.

source: Ресурсы представляю собой как статическое содержимое, так и результаты запуска алгоритмов конвертации данных, порождающими текстовое содержимое.
en_us: Resources represent both the static content and the results of an algorithm execution generating text content from source data.

source: Решение данной проблемы видится в разработке программной системы, позволяющей собирать тексты рабочих программ, аннотаций и ФОС из отдельных частей: перечня компетенций и распределения нагрузки (учебный план); содержания (преподаваемых тем модуля/курса) и ФОСа, тексты которых разделяется между разными версиями документов.
en_us: The solution to this problem is supposed to be in developing a software system that allows collecting the texts of the work programs, abstracts and FAMs from separate parts: a list of competencies and curriculum; the subject and module contents, whose text parts shared between different versions of documents.

source: Рис.
en_us: Fig.

source: Сегодня, большое количество информации публикуется в табличном виде в неструктурированных источниках (например, государственная статистика, финансовые и бизнес отчеты, наборы открытых научных данных, социальные медиа).
en_us: At present, a large amount of information is published in tabular form in unstructured sources, e.g., government statistics, financial and business reports, sets of open scientific data, social media.

source: Семантическая разметка представляет логическую структуру документа, предметные отношения между сущностями, представленными в документе, например, выделяются стороны, заключающие некоторое соглашение, предмет соглашения; формальные данные; отношения “часть-целое”, при помощи которых осуществляется секционирование текста документа.
en_us: The semantic markup is the logical structure of the document, the domain relations between the entities presented in the document, for example, the distinct [parties] are described in an agreement, subject of agreement; formal data; the “part-whole” relationships sectioning the text document.

source: Скрипты JavaScript реализуют различные представления документа (View), например, в виде формы ввода; производят преобразования частей текста, например, склонять существительные и подставлять местоимения, генерировать содержание и т.п.
en_us: JavaScript scrips implement various document views, e.g., as input forms, conversion of parts of text, e.g., to lean nouns and substitute pronouns, generate content, etc.

source: Согласование грамматики реализовано при помощи атрибутов id, data- и class.
en_us: Harmonization of grammar is implemented using the attributes id, data- and class.

source: Содержание страницы кодируется структурой ее URL и сверстывается в момент первого обращения.
en_us: The page content is defined by the structure of its URL and rendered at the time of first treatment.

source: Создаваемые документы хранятся на серверах, поддерживающих протокол HTTP (запросы GET и POST).
en_us: The edited documents are stored on servers that support HTTP Protocol (GET and POST requests).

source: Создана организация Cells Research Group (https://github.com/cellsrg), в которой реализованы два проекта: система распознавания структуры таблиц в PDF-документах (https://github.com/cellsrg/TabbyPDF); анализ семантической структуры таблиц Excel, основанный на применении правил (https://github.com/cellsrg/cells-ssdc).
en_us: We created an organization Cells Research Group at Github (https://github.com/cellsrg), where two projects have been implemented: a system of detection and recognition of tabular structures in PDF documents (https://github.com/cellsrg/TabbyPDF); a rule based semantic structure analysis of Excel spreadsheets (https://github.com/cellsrg/cells-ssdc).

source: Созданные программные средства и технологии направлены на разработку программной среды глобального электронного документооборота, позволяющего физическим лицам и организациям обмениваться документами, логическая структура которых трудноформализуема в рамках традиционных подходов к автоматизации документооборота.
en_us: The development is aimed at the implementation of a software environment for a global electronic document workflow, allowing individuals and organizations to share document data, logical structure which is difficult to formalize within the framework of traditional approaches to workflow automation.

source: Средств Microsoft Word и Excel, стандартно используемых для решения этой задачи, со встроенным VBA явно недостаточно.
en_us: Microsoft Word and Excel are commonly used for this task with a built-in VBA, but in this case it is clearly not enough.

source: Средства LOD обеспечивают информации, представленной в документе, логическую разметку, информативный базис для различных вариантов визуального представления и интерпретации, установку логических связей с другими документами, экспорт информации в другие документы, процедурную обработку и т.д.
en_us: The LOD provide a logical markup for the information presented in a document, informative basis for the different variants of visual representation and interpretation, logical connections with other documents, export information into other documents, procedural processing, etc.

source: Стандарт этой отологии принят в 2017 году, ее основная задача представлять содержимое (аннотацию), описывающее другое содержимое.
en_us: The ontology accepted in 2017, its main purpose is to describe the content (annotation) describing other content.

source: Страница, отображаемая пользователю, – это аннотация документа "#annotation", причем и аннотируемое содержимое, и текст аннотации – это одно и то же на этапе формирования документа: ресурс "#course-work-program".
en_us: The page displayed to the user is the annotation of the document "#annotation", with both the annotated content and the annotation text being the same at the stage of formation of the document - resource "#course-work-program".

source: Студентами Института математики, экономики и информатики Иркутского государственного университета разработано приложение для создания юридических документов – нестандартного вида постановлений судебных исполнителей и нотариальных документов.
en_us: Students of the Institute of mathematics, economics and Informatics of Irkutsk state university developed an application for creating legal documents, non-standard form of judgments of judicial officers and notarial documents.

source: Существует также огромный класс редакторов документов, ориентированных на создание научных публикаций (см., например, http://substance.io/).
en_us: There is also a huge class of document editors focused on the creation of scientific publications, see, e.g., http://substance.io/.

source: Существующая документация курса дополнена новыми формами обязательных документов – фондом оценочных средств (ФОС), аннотациями курсов.
en_us: The existing documentation of the courses is supplemented with new forms of mandatory documents: the Fund of assessment means (FAM), annotations of the courses.

source: Таким образом, dokieli представляет собой систему поддержки распределенного редактирования текстовых документов, который в полной мере реализует взаимодействие с другими ресурсами LOD, и все функции взаимодействия реализованы исключительно при помощи подпрограмм клиентского JavaScript.
en_us: Thus, dokieli is a system supporting distributed text content editing, which fully implements the interaction with other LOD resources, and all these functions are implemented exclusively by means of the client-side browser JavaScript.

source: Такой уровень достаточно легко реализуется при помощи современных систем контроля версий, например, GIT или Subversion.
en_us: This level is quite easy to be implemented using modern version control systems like GIT or Subversion.

source: Текст документа размечен при помощи стандарта RDFa.
en_us: The text of the document is being marked up with RDFa attributes.

source: Текст разбивается на разделы, обрамляется тегами <div> и <span> со соответствующими структурами RDFa.
en_us: The text is divided into sections, and wrapped by tags <div> and <span> with the relevant RDFa structures.

source: Тексты учебных программ вузов
en_us: The texts of the curricula of the universities

source: Технологии базируются на активном использовании RDFa-разметки.
en_us: The technologies are based on the active use RDFa markup.

source: Технологии верстки документов на основе LOD
en_us: Technology of document authoring based on the LOD

source: Технология Linked Open Data (LOD, открытые связанные данные) [1] предложена W3C-консорциумом для представления семантической информации в публикуемых данных таким образом, чтобы обеспечить не только возможность ее обработки при помощи программных агентов (Семантичекий Веб), но и связать всю имеющуюся информацию в единый семантический граф при помощи отношений и универсальных глобальных идентификаторов (URI) ресурсов.
en_us: Technology Linked Open Data (LOD) [1] has been suggested by W3C consortium to represent the semantic information in the data published in a way that provides not only the possibility of its processing with software agents (Semantic Web), but also to link all available information into a single semantic graph using relations and global universal identifiers (URIs) of theory resources.

source: Титульные листы формируются также из данных учебного плана и подготовленных шаблонов.
en_us: The title pages are generated from data of curriculum and designed templates.

source: Титульный лист и лист согласования вставляются со страницы шаблонов “imei.html” (сведения об Институте математики, экономики и информатики Иркутского государственного университета).
en_us: The title page and the approval page are inserted from the page templates prepared in “imei.html” (information about the Institute of mathematics, Economics and Informatics of Irkutsk state University).

source: Улан-Баторская, д.3, г.
en_us: Ulan-Bator str. 3,

source: Формат XML позволяет представлять логическую разметку основной части документа, а также хранить ее в самом документе.
en_us: The XML format allows to represent the logical structure of the main document body, and to store it in the document.

source: Формирование документа заканчивается, как только все условия не были активированы, и не осталось необработанных команд.
en_us: The document composition finalizes as soon as all conditions were activated.

source: Целью исследования является разработка подхода к разработке программного обеспечения, реализующего функции подготовки и верстки документов, размеченных согласно принципам LOD.
en_us: The aim of the study is to design an approach to the development of software performing the functions of the authoring and typesetting of documents marked up according to LOD principles.

source: Целю преподавания дисциплины "Технологии программирования" является освоение ...</p>
en_us: The purpose of the discipline "Programming Technologies" studying is the development of ...</p>

source: Черкашин Е.А.1,2,3, Шигаров А.О.1,3, Орлова И.В.2, Михайлов И.С.4
en_us: Cherkashin E. A. 1,2,3, Shigarov A. O. 1,3, 2 Orlova I. V., Mikhailov I. S. 4

source: Чтобы иметь возможность использовать данные из этих источников, прежде всего, необходимо извлечь эти данные и трансформировать их в размеченный текст или в таблицы реляционной базы данных.
en_us: To be able to use data from these sources, it is necessary to extract the data and transform it into marked-up text or in tables of a relational database.

source: Шаблоны текста обозначаются атрибутом id.
en_us: The text templates are identified by the id attribute.

source: Эта онтология используется в случае, если в перечисленных выше и специализированных по предметным областям документа онтологиях не находится подходящего отношения.
en_us: This ontology is used in the case if none of the above specialized ontological have a relevant term or a relationship denotation.

source: Это делает структуру семантической разметки более строгой за счет уменьшения количества сущностей.
en_us: This makes the structure of semantic markup to be more strict by reducing the number of entities.

source: Этот набор составляется для каждой возможной комбинации: вуз, кафедра, специальность, направление (профиль), программа, квалификация (бакалавр, специалист, магистрант, аспирант), академический или прикладной вариант квалификации, форма обучения (очная, заочная, вечерняя, очно-заочная и др.).
en_us: This set of documents is prepared for each following possible combination: the university, department, specialty, direction (profile), program, qualification level (bachelor, specialist, undergraduate, graduate), academic or applied version of the qualification, [form of study (full-time, part-time, evening, part-time,] etc.).
